---
kind: type
id: T:Autodesk.Revit.DB.GuidEnum
source: html/36623d19-ba65-63c0-337a-f43c593a9931.htm
---
# Autodesk.Revit.DB.GuidEnum

Base class of all GUID-based enum classes.

## Syntax (C#)
```csharp
public class GuidEnum
```